# Необходимо его обработать — обособить каждое целое число кавычками
# и дополнить нулём до двух целочисленных разрядов
# сформировать из обработанного списка строку
set_w = ['в', '5', 'часов', '17', 'минут', 'температура', 'воздуха', 'была', '+5', 'градусов']
print(id(set_w), set_w)
#39823560 ['в', '5', 'часов', '17', 'минут', 'температура', 'воздуха', 'была', '+5', 'градусов']
l = len(set_w)
i = 0
integer_ = []

while i < l:
    s = ''
    s = set_w[i]
    if '0' <= set_w[i] <= '9' or s[0] == '+':
        if s[0] == '+'and int(s) < 10:
            set_w[i] = '+' + '0' + s[1:]
            integer_.append(set_w[i])
        elif int(s) < 10:
            set_w[i] = '0' + s
            integer_.append(set_w[i])
        elif int(s) > 10:
            set_w[i] = s
            integer_.append(set_w[i])
        set_w.insert(i, '"')
        set_w.insert(i + 2, '"')
        l = len(set_w)
        i += 2
    i += 1
print(id(set_w), set_w)
#39823560 ['в', '"', '05', '"', 'часов', '"', '17', '"', 'минут', 'температура', 'воздуха', 'была', '"', '+05', '"', 'градусов']
str_integer = '/'.join(integer_)
#print(str_integer)  ['05', '17', '+05']
hour, min, temp = str_integer.split('/')
f_str = f'в "{hour}" часов "{min}" минут температура воздуха была "{temp}" градусов'
print(f_str)

#в "05" часов "17" минут температура воздуха была "+05" градусов

