# >>>thesaurus_adv("Иван Сергеев", "Инна Серова", "Петр Алексеев", "Илья Иванов", "Анна Савельева")
# {
#     "А": {
#         "П": ["Петр Алексеев"]
#     },
#     "С": {
#         "И": ["Иван Сергеев", "Инна Серова"],
#         "А": ["Анна Савельева"]
#     }
# }


def thesaurus_adv(*args):
    a = {}
    b = {}
    c = ""
    g = ""
    for i in o_lis:
        n = ''
        s = i
        rev = s[::-1]
        for j in rev:
            if j != ' ':
                n += j
            else:
                break
        c = n[::-1][0]
        a.setdefault(c, {})  # {'С': {}}
        g = i[0]
        a[c].setdefault(g, [])
        a[c][g].append(i)
    return a


o_lis = ["Иван Сергеев", "Инна Серова", "Петр Алексеев", "Илья Иванов", "Анна Савельева"]
print(f'thesaurus_adv(*o_lis) = {thesaurus_adv(*o_lis)}')


#{'С': {'И': ['Иван Сергеев', 'Инна Серова'], 'А': ['Анна Савельева']}, 'А': {'П': ['Петр Алексеев']}, 'И': {'И': ['Илья Иванов']}}